<?php

//    $k = $n % 10; // последняя цифра
//    $k = $n % 100; // последние две цифры
//    $p = intdiv($n, 10); // выкинуть последнюю цифру
//    $p = intdiv($n, 100); // выкинуть 2 последние цифры

// |
// Вывести все трехзначные цифры от 100-999, в которых
// не попадаются повторяющиеся цифры
// 112 - нет, 123 - да

function findNumbers()
{
// 1 способ
    for ($n = 100; $n <= 999; $n++) {
        $a = $n % 10; // последняя цифра
        $b = intdiv($n, 10) % 10; // средняя цифра
        $c = intdiv($n, 100); // первая справа цифра

        if ($a == $b || $a == $c || $b == $c) {
            echo $n . ' - yes<br>';
        } else {
            echo $n . ' - no<br>';
        }
    }
}

function findNumbersByFor()
{
// 2 способ
    $a = 7;
    $b = 8;
    $c = 9;
// 789
    $n = 100 * $a + 10 * $b + $c;

    for ($a = 1; $a <= 9; $a++) {
        for ($b = 0; $b <= 9; $b++) {
            for ($c = 0; $c <= 9; $c++) {
                if ($a !== $b && $a !== $c && $b !== $c) {
                    echo (100 * $a + 10 * $b + $c) . '<br>';
                }
            }
        }
    }
}

// findNumbers();

$k = mt_rand(100, 300);

// В заданном массиве найти наибольшее число
function findMax()
{
    $a = [1000, -2, -3, 9, 4];

    $max = $a[0]; // !!!
    for ($i = 0; $i < count($a); $i++) {
        echo $a[$i] . ' ';
        if ($max < $a[$i]) {
            $max = $a[$i];
        }
    }

    echo '<br>';
    echo $max;
}

// В заданном массиве поменять местами наибольшее число и наименьшее
function changeMaxMin()
{
    $a = [1000, -2, -3, 9, 4];
    // $a = [-3, -2, 1000, 9, 4];

    $max = $a[0];
    $min = $a[0];
    $imax = 0;
    $imin = 0;
    for ($i = 0; $i < count($a); $i++) {
        echo $a[$i] . ' ';
        if ($max < $a[$i]) {
            $max = $a[$i];
            $imax = $i;
        }
        if ($min > $a[$i]) {
            $min = $a[$i];
            $imin = $i;
        }
    }

    $temp = $a[$imax];
    $a[$imax] = $a[$imin];
    $a[$imin] = $temp;

//    $a = [1000, -2, -3, 9, 4]
//    $a[0] <-> $a[2]
//    $temp = $a[0];
//    $a[0] = $a[2];
//    $a[2] = $temp;

    echo '<br>';
    for ($i = 0; $i < count($a); $i++) {
        echo $a[$i] . ' ';
    }
}

// В заданном массиве найти сумму четных чисел
function findSum()
{
    $a = [1000, -2, -3, 9, 4];

    $sum = 0;
    for ($i = 0; $i < count($a); $i++) {
        if ($a[$i] % 2 == 0) {
            $sum += $a[$i];
        }
    }

    echo $sum;
}

// В заданном массиве найти количество чисел, соседи у которых нечетные
// [1000, 1, -3, 1, 4] -> 1 число
function countNumbers()
{
    $a = [1000, 1, 1, 1, 1];

    $count = 0;
    for ($i = 1; $i < count($a) - 1; $i++) {
        if ($a[$i - 1] % 2 == 1 && $a[$i + 1] % 2 == 1) {
            $count++;
        }
    }

    echo $count;
}

// Дан массив. Является ли он возрастающим
// [1, 4, 6, 8, 10, 34] -> да
// [1, 4, 6, 6, 10, 34] -> нет
// [1, 4, 6, -4, 10, 34] -> нет
function isUp()
{
    $a = [1, 4, 6, 8, 10, 34];

    $isUp = true;
    for ($i = 0; $i < count($a) - 1; $i++) {
        if ($a[$i] >= $a[$i + 1]) {
            $isUp = false;
            break;
        }
    }

    if ($isUp) {
        echo 'Yes';
    } else {
        echo 'No';
    }
}

isUp();